app/controllers/albums_controller.rb

SELECT "albums".* FROM "albums" WHERE "albums"."user_id" = $1  [["user_id", 1]]
---
  def index
    @albums = current_user.albums
    @q = current_user.albums.ransack(params[:q])
    @albums = @q.result.includes(:tags)

UPDATE "albums" SET "updated_at" = $1 WHERE "albums"."id" = $2  [["updated_at", "2022-05-11 07:09:17.407367"], ["id", 1]]
---
  def update
    if @album.update(album_params)

INSERT INTO "albums" ("title", "description", "publish", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Watches"], ["description", "Black watches"], ["publish", true], ["created_at", "2022-05-11 06:52:15.197747"], ["updated_at", "2022-05-11 06:52:15.197747"], ["user_id", 1]]
---
  def create
    @album = current_user.albums.new(album_params)

    if @album.save

SELECT "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def purge
    album = Album.find_by(id: params[:album_id])

SELECT "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def load_album
    @album = Album.find(params[:id])