app/controllers/home_controller.rb

SELECT "albums".* FROM "albums" WHERE "albums"."user_id" = $1 AND "albums"."publish" = $2  [["user_id", 1], ["publish", true]]
---
  def index
    @albums = if user_signed_in?
                current_user.albums.where(publish: true)