app/models/album.rb

SELECT "tags".* FROM "tags" INNER JOIN "albums_tags" ON "tags"."id" = "albums_tags"."tag_id" WHERE "albums_tags"."album_id" = $1  [["album_id", 1]]
INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "men watches"], ["created_at", "2022-05-11 06:52:08.382533"], ["updated_at", "2022-05-11 06:52:08.382533"]]
SELECT "tags".* FROM "tags" WHERE "tags"."name" = $1 ORDER BY "tags"."id" ASC LIMIT $2  [["name", "men watches"], ["LIMIT", 1]]
---
  def tagged=(names)
    self.tags = names.split(',').map do |name|
      Tag.where(name: name.strip).first_or_create!